---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.WrongDepthDimensionLabel
source: html/6d8b67fa-22eb-2674-3bc8-9eda54a43b8d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.WrongDepthDimensionLabel Property

Multi-planar depth dimension label is already used for one of the planar shape parameters.

## Syntax (C#)
```csharp
public static FailureDefinitionId WrongDepthDimensionLabel { get; }
```